
def likes(names):
    answer = {
        0: "Никто не оценил данную запись",
        1: "{0} оценил(а) данную запись",
        2: "{0} и {1} оценили данную запись",
        3: "{0}, {1} и {2} оценили данную запись",
        4: "{0}, {1} и {2} других оценили данную запись"
        }
    return answer[len(names)].format(*names) if len(names) <=3 else answer[4].format(names[0], names[1], len(names) - 2)


print(likes([]))
print(likes(['Тимур']))
print(likes(['Тимур', 'Артур']))
print(likes(['Тимур', 'Артур', 'Руслан']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима']))
print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима', 'Рома', 'Гвидо', 'Марк']))
